Documents/НачальныеРасчетыСБюджетомПоНДФЛ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>НачальныеРасчетыСБюджетомПоНДФЛ</Name>
			<Comment>АПК:93 Представления объекта и списка совпадают с синонимом</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РасчетыСБюджетомПоНДФЛ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОстатков</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасчетыПоПолучателям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РегистрацияВНалоговомОргане</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСПревышения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеПоСтатьям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяФинансирования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиРасходовЗарплата</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Результат</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезультатСПревышения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/БухучетЗарплатыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>БухучетЗарплатыОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СпособОтраженияЗарплатыВБухучете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВБухУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтношениеКЕНВД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОтношениеКЕНВДЗатратНаЗарплату</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатьяФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиФинансированияЗарплата</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИсторияРегистрацийВНалоговомОрганеВторичный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияРегистрацийВНалоговомОрганеВторичный</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрацияВНалоговомОргане</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегистрацииВНалоговомОргане</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТерриторияВыполненияРабот</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/НачальныеРасчетыСБюджетомПоНДФЛ/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
	
		ЗначенияДляЗаполнения = Новый Структура("Организация, Ответственный",
			"Объект.Организация",
			"Объект.Ответственный");
		ЗарплатаКадры.ЗаполнитьПервоначальныеЗначенияВФорме(ЭтаФорма, ЗначенияДляЗаполнения);
		
		Если Не ЗначениеЗаполнено(Объект.ДатаОстатков) Тогда
			Объект.ДатаОстатков = НачалоМесяца(Объект.Дата);
		КонецЕсли;
		
		ПриПолученииДанныхНаСервере(Объект);
		
	КонецЕсли;
	
	ПрочитатьГоловнуюОрганизацию();
	ПрочитатьФинансированиеОрганизации();
	СтатьяРасходов = ОтражениеЗарплатыВБухучетеРасширенный.СтатьяРасходов211();
	
	// Обработчик подсистемы "ВерсионированиеОбъектов".
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПриПолученииДанныхНаСервере(ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства

	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	РеквизитыВДанные(ТекущийОбъект);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ДанныеВРеквизиты();
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаОстатковПриИзменении(Элемент)
	
	ПрочитатьФинансированиеОрганизации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРасчетыПоПолучателям

&НаКлиенте
Процедура РасчетыПоПолучателямВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если СтрНайти(Поле.Имя, "ПредставлениеРаспределения") <> 0 Тогда
		ТекущиеДанные = Элементы.РасчетыПоПолучателям.ТекущиеДанные;
		РедактироватьСтроку(ТекущиеДанные, ВыбраннаяСтрока);
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РасчетыПоПолучателямСуммаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасчетыПоПолучателям.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьРезультатРаспределения(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура РасчетыПоПолучателямСуммаСПревышенияПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.РасчетыПоПолучателям.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьРезультатРаспределения(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Заполнить(Команда)
	
	ОчиститьСообщения();
	ЗаполнитьНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

&НаСервере
Процедура ПриПолученииДанныхНаСервере(ТекущийОбъект)
	
	РаботаВБюджетномУчреждении = ПолучитьФункциональнуюОпцию("РаботаВБюджетномУчреждении");
	ИспользоватьСтатьиФинансирования = ПолучитьФункциональнуюОпцию("ИспользоватьСтатьиФинансированияЗарплата");
	
	ДанныеВРеквизиты();
	
КонецПроцедуры

&НаСервере
Процедура РеквизитыВДанные(ТекущийОбъект)
	
	Если Не ИспользоватьСтатьиФинансирования Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекущийОбъект.РаспределениеПоСтатьям.Очистить();
	
	Для каждого СтрокаТЧ Из Объект.РасчетыПоПолучателям Цикл
		
		ИдентификаторСтроки = Новый УникальныйИдентификатор;
		
		СтрокаТЧ.ИдентификаторСтроки = ИдентификаторСтроки;
		ТекущийОбъект.РасчетыПоПолучателям[Объект.РасчетыПоПолучателям.Индекс(СтрокаТЧ)].ИдентификаторСтроки = ИдентификаторСтроки;
		
		РезультатРаспределения = СтрокаТЧ.РезультатРаспределения;
		Если РезультатРаспределения <> Неопределено Тогда
			Для Каждого СтрокаРаспределения Из РезультатРаспределения Цикл
				НоваяСтрока = ТекущийОбъект.РаспределениеПоСтатьям.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения);
				НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДанныеВРеквизиты()
		
	Если Не ИспользоватьСтатьиФинансирования Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);

	ДанныеРаспределения = Объект.РаспределениеПоСтатьям.Выгрузить();
	ОтражениеЗарплатыВБухучетеРасширенный.ДополнитьТаблицуРаспределенияКодомСтатьиФинансирования(ДанныеРаспределения);
	
	ПроверяемыеПоля = Новый Структура;
	ПроверяемыеПоля.Вставить("СтатьяФинансирования", Истина);
	ПроверяемыеПоля.Вставить("СтатьяРасходов", РаботаВБюджетномУчреждении);
	ПроверяемыеПоляРаспределения = Новый ФиксированнаяСтруктура(ПроверяемыеПоля);
	
	Отбор = Новый Структура("ИдентификаторСтроки");
	Для каждого СтрокаТЧ Из Объект.РасчетыПоПолучателям Цикл
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаТЧ);
		РаспределениеСтроки = ДанныеРаспределения.Скопировать(Отбор);
		СтрокаТЧ.РезультатРаспределения = ЗарплатаКадрыРасширенный.ТаблицаЗначенийВСтруктуру(РаспределениеСтроки);
		СтрокаТЧ.ПредставлениеРаспределения = ПредставлениеРаспределения(СтрокаТЧ, РаспределениеСтроки, ПроверяемыеПоляРаспределения, РаботаВБюджетномУчреждении);
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПредставлениеРаспределения(СтрокаДанных, РаспределениеСтроки, ПроверяемыеПоляРаспределения, РаботаВБюджетномУчреждении)

	РаспределениеДляПредставления = Новый Массив;;
	
	ЕстьОшибкиЗаполнения = Ложь;
	ЕстьОшибкиРаспределения = Ложь;
		
	РезультатРаспределения = 0;
	ЕстьОшибкиЗаполнения = Ложь;
	Для каждого СтрокаРаспределения Из РаспределениеСтроки Цикл
		
		НоваяСтрока = НоваяСтрокаРаспределения();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения);
		НоваяСтрока.Результат = НоваяСтрока.Результат + СтрокаРаспределения.РезультатСПревышения;
		РаспределениеДляПредставления.Добавить(НоваяСтрока);
		
		РезультатРаспределения = РезультатРаспределения + СтрокаРаспределения.Результат + СтрокаРаспределения.РезультатСПревышения;
		Для Каждого КлючИЗначение Из ПроверяемыеПоляРаспределения Цикл
			Если КлючИЗначение.Значение И Не ЗначениеЗаполнено(СтрокаРаспределения[КлючИЗначение.Ключ]) Тогда
				ЕстьОшибкиЗаполнения = Истина;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	СуммаВсего = СтрокаДанных.Сумма + СтрокаДанных.СуммаСПревышения;
	
	Если СуммаВсего = 0 И РезультатРаспределения = 0 Тогда
		ЕстьОшибкиРаспределения = Ложь;
		ЕстьОшибкиЗаполнения = Ложь;
	Иначе
		ЕстьОшибкиРаспределения = СуммаВсего <> РезультатРаспределения;
	КонецЕсли;
	
	РаспределениеСодержитОшибки = ЕстьОшибкиРаспределения Или ЕстьОшибкиЗаполнения;
	
	Возврат ОтражениеЗарплатыВБухучетеКлиентСерверРасширенный.ПредставлениеРаспределения(РаспределениеДляПредставления, РаспределениеСодержитОшибки, РаботаВБюджетномУчреждении);

КонецФункции

&НаКлиенте
Процедура РедактироватьСтроку(ДанныеСтроки, ВыбраннаяСтрока)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ТолькоПросмотр", 					ЭтаФорма.ТолькоПросмотр);
	ПараметрыОткрытия.Вставить("РегистрацияВНалоговомОргане", 		ДанныеСтроки.РегистрацияВНалоговомОргане);
	ПараметрыОткрытия.Вставить("РаспределяемаяСумма", 				ДанныеСтроки.Сумма);
	ПараметрыОткрытия.Вставить("РаспределяемаяСуммаСПревышения", 	ДанныеСтроки.СуммаСПревышения);
	ПараметрыОткрытия.Вставить("РаспределениеПоСтатьям", 			ДанныеСтроки.РезультатРаспределения);
	ПараметрыОткрытия.Вставить("ПроверяемыеПоляРаспределения", 		ПроверяемыеПоляРаспределения);
	
	ДополнительныеПараметры = Новый Структура("ИдентификаторСтроки", ВыбраннаяСтрока);
	Оповещение = Новый ОписаниеОповещения("РедактироватьСтрокуЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ОткрытьФорму("Документ.НачальныеРасчетыСБюджетомПоНДФЛ.Форма.РедактированиеРаспределения",
				ПараметрыОткрытия, ЭтаФорма, Истина, , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
			
&НаКлиенте
Процедура РедактироватьСтрокуЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Истина;
	
	ТекущиеДанные = Объект.РасчетыПоПолучателям.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	ТекущиеДанные.РезультатРаспределения = Результат.РаспределениеПоСтатьям;
	ТекущиеДанные.ПредставлениеРаспределения = ПредставлениеРаспределения(ТекущиеДанные, ТекущиеДанные.РезультатРаспределения, ПроверяемыеПоляРаспределения, РаботаВБюджетномУчреждении);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьГоловнуюОрганизацию()
	
	ГоловнаяОрганизация = ЗарплатаКадры.ГоловнаяОрганизация(Объект.Организация);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	ПрочитатьГоловнуюОрганизацию();
	ПрочитатьФинансированиеОрганизации();
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФинансированиеОрганизации()

	Если Не ИспользоватьСтатьиФинансирования Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ДатаАктуальности", ?(ЗначениеЗаполнено(Объект.ДатаОстатков), Объект.ДатаОстатков, Объект.Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	БухучетЗарплатыОрганизацийСрезПоследних.СтатьяФинансирования КАК СтатьяФинансирования,
	|	БухучетЗарплатыОрганизацийСрезПоследних.СтатьяФинансирования.Код КАК Код
	|ИЗ
	|	РегистрСведений.БухучетЗарплатыОрганизаций.СрезПоследних(&ДатаАктуальности, Организация = &Организация) КАК БухучетЗарплатыОрганизацийСрезПоследних";
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		СтатьяФинансирования    = Выборка.СтатьяФинансирования;
		КодСтатьиФинансирования = Выборка.Код;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()

	Если НЕ ФормаДокументаГотоваДляЗаполнения() Тогда
		Возврат;
	КонецЕсли;
	
	Объект.РасчетыПоПолучателям.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ГоловнаяОрганизация", ГоловнаяОрганизация);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("ДатаАктуальности", Объект.ДатаОстатков);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РегистрацииВНалоговомОргане.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТРегистрации
	|ИЗ
	|	Справочник.РегистрацииВНалоговомОргане КАК РегистрацииВНалоговомОргане
	|ГДЕ
	|	РегистрацииВНалоговомОргане.Владелец = &ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ИсторияРегистраций.РегистрацияВНалоговомОргане КАК РегистрацияВНалоговомОргане
	|ИЗ
	|	ВТРегистрации КАК Регистрации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияРегистрацийВНалоговомОрганеВторичный КАК ИсторияРегистраций
	|		ПО Регистрации.Ссылка = ИсторияРегистраций.РегистрацияВНалоговомОргане
	|ГДЕ
	|	&ДатаАктуальности МЕЖДУ ИсторияРегистраций.ДатаНачала И ИсторияРегистраций.ДатаОкончания
	|	И ВЫБОР
	|			КОГДА ИсторияРегистраций.СтруктурнаяЕдиница ССЫЛКА Справочник.Организации
	|				ТОГДА ИсторияРегистраций.СтруктурнаяЕдиница
	|			ИНАЧЕ ИсторияРегистраций.СтруктурнаяЕдиница.Владелец
	|		КОНЕЦ = &Организация";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.РасчетыПоПолучателям.Добавить(), Выборка);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ФормаДокументаГотоваДляЗаполнения()
	
	ФормаДокументаГотова = Истина;
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ФормаДокументаГотова = Ложь;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Необходимо указать организацию.'"), , "Организация");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ДатаОстатков) Тогда
		ФормаДокументаГотова = Ложь;		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Необходимо указать дату остатков.'"), , "ДатаОстатков");
	КонецЕсли;
	
	Возврат ФормаДокументаГотова;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьРезультатРаспределения(ТекущиеДанные)

	Если Не ИспользоватьСтатьиФинансирования Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Сумма = 0 И ТекущиеДанные.СуммаСПревышения = 0 Тогда
		
		ТекущиеДанные.РезультатРаспределения = Неопределено;
		ТекущиеДанные.ПредставлениеРаспределения = "";
		
	ИначеЕсли ТекущиеДанные.РезультатРаспределения = Неопределено Или ТекущиеДанные.РезультатРаспределения.Количество() = 0 Тогда
		
		СтрокаРаспределения = НоваяСтрокаРаспределения();
		СтрокаРаспределения.КодСтатьиФинансирования = СОКРЛП(КодСтатьиФинансирования);
		СтрокаРаспределения.СтатьяФинансирования 	= СтатьяФинансирования;
		СтрокаРаспределения.СтатьяРасходов 			= СтатьяРасходов;
		СтрокаРаспределения.Результат 				= ТекущиеДанные.Сумма;
		СтрокаРаспределения.РезультатСПревышения 	= ТекущиеДанные.СуммаСПревышения;
		
		РезультатРаспределения = Новый Массив;
		РезультатРаспределения.Добавить(Новый ФиксированнаяСтруктура(СтрокаРаспределения));
		ТекущиеДанные.РезультатРаспределения = Новый ФиксированныйМассив(РезультатРаспределения);
		ТекущиеДанные.ПредставлениеРаспределения = ПредставлениеРаспределения(ТекущиеДанные, РезультатРаспределения, ПроверяемыеПоляРаспределения, РаботаВБюджетномУчреждении);
		
	Иначе
		
		ВсегоРаспределено = 0;
		ВсегоРаспределеноСПревышения = 0;
		РезультатРаспределения = Новый Массив;
		РезультатРаспределенияСПревышения = Новый Массив;
		Для каждого СтрокаРаспределения Из ТекущиеДанные.РезультатРаспределения Цикл
			ВсегоРаспределено = ВсегоРаспределено + СтрокаРаспределения.Результат;
			ВсегоРаспределеноСПревышения = ВсегоРаспределеноСПревышения + СтрокаРаспределения.РезультатСПревышения;
			Если СтрокаРаспределения.Результат <> 0 Тогда
				РезультатРаспределения.Добавить(СтрокаРаспределения);
			КонецЕсли;
			Если СтрокаРаспределения.РезультатСПревышения <> 0 Тогда
				//НоваяСтрока = НоваяСтрокаРаспределения();
				//ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения);
				РезультатРаспределенияСПревышения.Добавить(СтрокаРаспределения);
			КонецЕсли;
		КонецЦикла;
		
		Если ВсегоРаспределено <> ТекущиеДанные.Сумма Тогда
			Если ЗначениеЗаполнено(РезультатРаспределения) Тогда
				РезультатРаспределения = ОтражениеЗарплатыВБухучетеРасширенныйВызовСервера.РезультатРаспределенияСуммыПоБазе(ТекущиеДанные.Сумма, РезультатРаспределения, "Результат", 0);
			Иначе
				СтрокаРаспределения = НоваяСтрокаРаспределения();
				СтрокаРаспределения.КодСтатьиФинансирования = СОКРЛП(КодСтатьиФинансирования);
				СтрокаРаспределения.СтатьяФинансирования 	= СтатьяФинансирования;
				СтрокаРаспределения.СтатьяРасходов 			= СтатьяРасходов;
				СтрокаРаспределения.Результат 				= ТекущиеДанные.Сумма;
				РезультатРаспределения = Новый Массив;
				РезультатРаспределения.Добавить(Новый ФиксированнаяСтруктура(СтрокаРаспределения));
				РезультатРаспределения = Новый ФиксированныйМассив(РезультатРаспределения);
			КонецЕсли;
		КонецЕсли;
		
		Если ВсегоРаспределеноСПревышения <> ТекущиеДанные.СуммаСПревышения Тогда
			Если ЗначениеЗаполнено(РезультатРаспределенияСПревышения) Тогда
				РезультатРаспределенияСПревышения = ОтражениеЗарплатыВБухучетеРасширенныйВызовСервера.РезультатРаспределенияСуммыПоБазе(ТекущиеДанные.СуммаСПревышения, РезультатРаспределенияСПревышения, "РезультатСПревышения", 0);
			Иначе
				СтрокаРаспределения = НоваяСтрокаРаспределения();
				СтрокаРаспределения.КодСтатьиФинансирования = СОКРЛП(КодСтатьиФинансирования);
				СтрокаРаспределения.СтатьяФинансирования 	= СтатьяФинансирования;
				СтрокаРаспределения.СтатьяРасходов 			= СтатьяРасходов;
				СтрокаРаспределения.РезультатСПревышения 	= ТекущиеДанные.СуммаСПревышения;
				РезультатРаспределенияСПревышения = Новый Массив;
				РезультатРаспределенияСПревышения.Добавить(Новый ФиксированнаяСтруктура(СтрокаРаспределения));
				РезультатРаспределенияСПревышения = Новый ФиксированныйМассив(РезультатРаспределенияСПревышения);
			КонецЕсли;
		КонецЕсли;
		
		ТекущиеДанные.РезультатРаспределения = НовыйРезультатРаспределения(РезультатРаспределения, РезультатРаспределенияСПревышения);
		ТекущиеДанные.ПредставлениеРаспределения = ПредставлениеРаспределения(ТекущиеДанные, ТекущиеДанные.РезультатРаспределения, ПроверяемыеПоляРаспределения, РаботаВБюджетномУчреждении);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыйРезультатРаспределения(РезультатРаспределения, РезультатРаспределенияСПревышения)

	ОписаниеРаспреденения = НоваяСтрокаРаспределения();
	ТаблицаРаспределения = Новый ТаблицаЗначений;
	Для каждого ЭлементКоллекции Из ОписаниеРаспреденения Цикл
		ТаблицаРаспределения.Колонки.Добавить(ЭлементКоллекции.Ключ);
	КонецЦикла;
	
	Для каждого СтрокаРаспределения Из РезультатРаспределения Цикл
		НоваяСтрока = ТаблицаРаспределения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения);
		НоваяСтрока.РезультатСПревышения = 0;
	КонецЦикла;
	Для каждого СтрокаРаспределения Из РезультатРаспределенияСПревышения Цикл
		НоваяСтрока = ТаблицаРаспределения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРаспределения);
		НоваяСтрока.Результат = 0;
		НоваяСтрока.РезультатСПревышения = СтрокаРаспределения.РезультатСПревышения;
	КонецЦикла;
	ТаблицаРаспределения.Свернуть("КодСтатьиФинансирования,СтатьяФинансирования,СтатьяРасходов","Результат,РезультатСПревышения");
	
	НовыйРезультатРаспределения = Новый Массив;
	Для каждого СтрокаТЗ Из ТаблицаРаспределения Цикл
		НовыйРезультатРаспределения.Добавить(Новый ФиксированнаяСтруктура(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТЗ)));
	КонецЦикла;
	
	Возврат Новый ФиксированныйМассив(НовыйРезультатРаспределения);

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция НоваяСтрокаРаспределения()

	Возврат Новый Структура("
		|КодСтатьиФинансирования,
		|СтатьяФинансирования,
		|СтатьяРасходов,
		|Результат,
		|РезультатСПревышения");

КонецФункции


#КонецОбласти
